// =======================================================================
// КОНСТАНТЫ РУССКИХ НАЗВАНИЙ
// =======================================================================
const TYPE_RU = {
    normal:"Нормальный", fire:"Огненный", water:"Водный", grass:"Травяной",
    electric:"Электрический", ice:"Ледяной", fighting:"Боевой", poison:"Ядовитый",
    ground:"Земляной", flying:"Летающий", psychic:"Психический", bug:"Насекомый",
    rock:"Каменный", ghost:"Призрачный", dark:"Тёмный", dragon:"Драконий",
    steel:"Стальной", fairy:"Волшебный"
};
const ABILITY_RU = {
    "blaze":"Пламя", "solar-power":"Солнечная сила", "overgrow":"Буйная растительность",
    "torrent":"Стремительный", "static":"Статическое электричество", "lightning-rod":"Громоотвод",
    "pickup":"Сбор", "guts":"Мужество", "intimidate":"Запугивание", "shed-skin":"Сброс кожи",
    "compound-eyes":"Составные глаза", "levitate":"Левитация", "pressure":"Давление",
    "clear-body":"Чистое тело", "sturdy":"Крепкое тело", "sand-stream":"Песчаный поток",
    "drizzle":"Проливной дождь", "drought":"Засуха", "sand-veil":"Песчаная вуаль",
    "swift-swim":"Быстрое плавание", "chlorophyll":"Хлорофилл", "hustle":"Суета",
    "serene-grace":"Безмятежная грация", "natural-cure":"Естественное исцеление",
    "run-away":"Бегство", "keen-eye":"Острый глаз", "hyper-cutter":"Гипер-резак",
    "shell-armor":"Панцирь", "water-absorb":"Водопоглощение", "volt-absorb":"Энергопоглощение",
    "flash-fire":"Огненный щит", "flame-body":"Огненное тело", "magma-armor":"Магма-броня",
    "white-smoke":"Белый дым", "clear-smoke":"Чистый дым", "shield-dust":"Щитовая пыль",
};